activefirmwaretools/activefirmwaretools/active-debugger/firmware/ActiveFirmwareBootloadableV4p0.cydsn/Generated_Source/PSoC4/AB_SELECT.h
/*******************************************************************************
* File Name: AB_SELECT.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_AB_SELECT_H) /* CY_STATUS_REG_AB_SELECT_H */
#define CY_STATUS_REG_AB_SELECT_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} AB_SELECT_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 AB_SELECT_Read(void) ;
void AB_SELECT_InterruptEnable(void) ;
void AB_SELECT_InterruptDisable(void) ;
void AB_SELECT_WriteMask(uint8 mask) ;
uint8 AB_SELECT_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define AB_SELECT_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define AB_SELECT_INPUTS              1


/***************************************
*             Registers
***************************************/

/* Status Register */
#define AB_SELECT_Status             (* (reg8 *) AB_SELECT_sts_sts_reg__STATUS_REG )
#define AB_SELECT_Status_PTR         (  (reg8 *) AB_SELECT_sts_sts_reg__STATUS_REG )
#define AB_SELECT_Status_Mask        (* (reg8 *) AB_SELECT_sts_sts_reg__MASK_REG )
#define AB_SELECT_Status_Aux_Ctrl    (* (reg8 *) AB_SELECT_sts_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_AB_SELECT_H */


/* [] END OF FILE */
